; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob20) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 distributor0)
	(clear crate3)
	(at pallet2 distributor1)
	(clear crate2)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 257)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 399)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 2)
	(at crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 11)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 26)
	(at crate3 distributor0)
	(on crate3 crate0)
	(= (weight crate3) 22)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet1)
		(on crate1 pallet2)
		(on crate2 crate3)
		(on crate3 pallet0)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 4
2. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 1 to 11
   goals met: 1 of 4
3. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 11
   goals met: 1 of 4
4. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 11 to 12
   goals met: 1 of 4
5. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 12 to 22
   goals met: 1 of 4
6. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 11 to 37
   goals met: 1 of 4
7. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 37 to 26
   goals met: 1 of 4
8. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 22 to 32
   goals met: 1 of 4
9. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 26 to 0
   goals met: 1 of 4
10. (drop hoist2 crate1 pallet2 distributor1)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 pallet2)
   goals met: 2 of 4
11. (load hoist1 crate2 truck1 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 26
   goals met: 2 of 4
12. (lift hoist1 crate3 crate0 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 crate0)
   added: (lifting hoist1 crate3) (clear crate0)
   changed: (fuel-cost) from 32 to 33
   goals met: 2 of 4
13. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   changed: (current_load truck1) from 26 to 48
   goals met: 2 of 4
14. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 33 to 43
   goals met: 2 of 4
15. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck1) from 48 to 26
   goals met: 2 of 4
16. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 3 of 4
17. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck1) from 26 to 0
   goals met: 3 of 4
18. (drop hoist0 crate2 crate3 depot0)
   deleted: (lifting hoist0 crate2) (clear crate3)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate3)
   goals met: 4 of 4
